{
  "label": {
    "Education": "Educación",
    "Contact": "Contacte con",
    "French": "FRANCÉS",
    "English": "INGLÉS",
    "Spanish": "ESPAÑOL",
    "FirstName": "Nombre",
    "LastName": "Apellido",
    "Email": "Correo electrónico",
    "Message": "Mensaje",
    "Submit": "Enviar",
    "discover": "descubrir más ..."
  },
  "title": {
    "project1": "Concepción y creación de una API REST que gestiona las publicaciones dentro de un científico de revisión con spring boot,spring security y JWT",
    "project2": "Concepción y realización de una aplicación móvil para la gestión de las ausencias con spring boot e IONIC 4",
    "project3": "Creación de motor de búsqueda de imágenes con React, Redux, Semantic UI y Pixabay API",
    "project4": "Creación de una aplicación de escritorio para la gestión de mediatecas con JAVA SE, MySQL y Swing",
    "Projects": "Proyectos",
    "Experiences": "Experiencias",
    "Skills": "Habilidades",
    "Education1": "Máster en informática, ingeniería de sistemas y software",
    "Education2": "Ingeniero de software",
    "Formation1": "El núcleo del Máster en Informática, Sistemas e Ingeniería del Software, se centra en profundizar en las técnicas de desarrollo de software, en línea con los temas principales del departamento de investigación DISC del instituto FEMTO-ST y el ecosistema industrial del curso. Este curso es el curso estándar del Máster en clase; se refuerza en el curso CMI (Máster en Ingeniería, curso) que contiene además algunas Unidades Didácticas",
    "Formation2": "Los graduados en Ingeniería Informática de ENSA son capaces de trabajar en una amplia variedad de profesiones en prácticamente todos los sectores de la economía. Tienen los conocimientos técnicos necesarios combinados con buenas habilidades interpersonales\n y un conocimiento de las organizaciones y del funcionamiento de las empresas. Desde el punto de vista técnico, tiene la capacidad de diseñar (componentes o arquitectura de software) así como de integrar (montaje de subconjuntos cuyas funcionalidades y coordinación domina). La adquisición de estas competencias técnicas da una gran parte a la autoformación, con el fin de garantizar una buena adaptación a su entorno profesional y a las evoluciones futuras"
  },
  "experience": {
    "title1": "SOLUCIÓN DE BANCA DIGITAL BACK-END EN MICRO SERVICIOS Y FRONT-END CON REACT",
    "title2": "CONCEPCIÓN Y CREACIÓN DE UNA APLICACIÓN MÓVIL PARA LA GESTIÓN DEL SITIO",
    "title3": "CONCEPCIÓN Y CREACIÓN DE UNA APLICACIÓN WEB PARA LA GESTIÓN DE ARCHIVOS CSV",
    "title4": "CONCEPCIÓN Y CREACIÓN DE UNA APLICACIÓN WEB PARA LA GESTIÓN DE EXISTENCIAS",
    "title5": "PRÁCTICAS DE OBSERVACIÓN",
    "description1": "▪ IMPLEMENTACIÓN DE UNA APLICACIÓN PARA LA GESTIÓN DE TRANSFERENCIAS INTERNACIONALES.\nEl proyecto es una aplicación de microservicios y sirve para:\n- Solicitar una transferencia internacional de crédito\n- Declaración de los beneficiarios internacionales\n- Firmar una solicitud de transferencia internacional\n- Ver el historial y seguir el estado de una transferencia internacional y una declaración de beneficiarios solicitar la declaración de beneficiarios\n▪ DISEÑO Y DESARROLLO DE UN MÓDULO DE ENCRIPTACIÓN Y SELLADO\n- El módulo consiste en desencriptar y desprecintar los ficheros descargados para realizar una reordenación antes de comprobar la validez del fichero. para comprobar la validez del fichero, para ello cada cliente tiene una clave pública para realizar el precintado y para el encriptado todos los clientes utilizan la misma clave para desencriptar los ficheros descargados ",
    "description2": "▪ Desarrollado por un equipo de 2 personas utilizando el método AGILE.\n▪ El front-end de la aplicación está desarrollado por IONIC 4 y Angular framework, el back-end está desarrollado por Spring boot\n▪ Uso de Spring Security y JWT para la seguridad de la aplicación",
    "description3": "▪ La aplicación está desarrollada en PHP (Laravel Framework) Creación de una orden utilizando el trabajo de Laravel que se ejecuta diariamente para leer archivos csv de un servidor FTP y procesarlos con el fin de mostrar las estadísticas",
    "description4": "▪ El proyecto es una aplicación monolítica diseñada en base al patrón de diseño MVC en el lado del servidor, la parte de presentación está desarrollada por el motor de plantillas Thymeleaf",
    "description5": "▪ Actualización de la red LAN de la agencia provincial de servicios de Beni Mellal e instalación de routers de acceso seguro a través de una red móvil 4G/3G",
    "years": "Años de experiencia",
    "describeMe": "Desarrollador web y móvil, especializado en microservicios con java y front-end con Angular/react"
  },
  "info": {
    "title": "Ingeniero de software (JavaEE, react/Angular), freelance basado en Francia",
    "contactMe": "Contacta conmigo"
  },
  "skills": {
    "title1": "SGBD",
    "title2": "Análisis y diseño",
    "title3": "Lenguajes de programación",
    "title4": "Desarrollo web",
    "title5": "Desarrollo móvil",
    "title6": "Software/IDE"
  }
}
