{
  "langues":"اللغات",
  "label": {
    "Education": "التعليم",
    "Contact": "إتصال",
    "French": "الفرنسية",
    "English": "الانجليزية",
    "Spanish": "الاسبانية",
    "FirstName": "الاسم ",
    "LastName": "إسم العائلة",
    "Email": "Email",
    "Message": "Message",
    "Submit": "Envoyer",
    "discover": "découvrir plus ...",
    "Languages": "Langues",
    "Arabic": "Arabe"
  },
  "title": {
    "project1": "تصميم وإنشاء واجهة برمجة تطبيقات REST تدير المنشورات في مجلة علمية باستخدام حذاء الربيع وأمن الربيع و JWT",
    "project2": "Conception et réalisation d'une application mobile pour la gestion des absences avec spring boot et IONIC 4",
    "project3": "Création d'un moteur de recherche d'images avec React, Redux, Semantic UI et Pixabay API",
    "project4": "Création d'une application de bureau pour la gestion d'une médiathèque avec JAVA SE, MySQL et Swing",
    "Projects": "Projets",
    "Experiences": "Expériences",
    "Skills": "Compétences",
    "Education1": "Master en informatique, en ingénierie des systèmes et des logiciels.",
    "Education2": "Ingénieur logiciel",
    "Formation1": "Le cœur du master Informatique, parcours Ingénierie Systèmes et Logiciels porte sur les techniques approfondies du développement logiciel, en phase avec les thématiques phares du département de recherche DISC de l'institut FEMTO-ST et de l'écosystème industriel de la formation. Ce parcours est le parcours standard de Master en présentiel; il est renforcé dans le parcours CMI (Cursus Master en Ingénierie, parcours) qui contient en plus quelques Unités d'Enseignement",
    "Formation2": "Les diplômés de l'ENSA en ingénierie informatique sont capables d'exercer des métiers très variés dans pratiquement tous les secteurs de l'économie. Ils possèdent les compétences techniques nécessaires associées à un bon relationnel et à une sensibilisation aux organisations et au fonctionnement des entreprises. D'un point de vue technique, il/elle a la capacité de concevoir (composants ou architecture logicielle) ainsi que d'intégrer (assemblage de sous-ensembles dont les fonctionnalités et la coordination sont maîtrisées). L'acquisition de ces compétences techniques fait une large part à l'autoformation, de manière à assurer une bonne adaptation à son environnement professionnel et aux évolutions futures."
  },
  "experience": {
    "title0": "INGÉNIEUR LOGICIEL",
    "title1": "SOLUTION BANCAIRE NUMÉRIQUE BACK END EN MICRO SERVICES & FRONT END AVEC REACT",
    "title2": "CONCEPTION ET RÉALISATION D’UNE APPLICATION MOBILE POUR LA GESTION DES CHANTIERS",
    "title3": "CONCEPTION ET CRÉATION D'UNE APPLICATION WEB DE GESTION DE FICHIERS CSV",
    "title4": "CONCEPTION ET RÉALISATION D'UNE APPLICATION WEB POUR LA GESTION DES STOCKS",
    "title5": "STAGE D'OBSERVATION",
    "description0": "EN COURS ...",
    "description1": "▪ MISE EN ŒUVRE D'UNE APPLICATION POUR LA GESTION DES TRANSFERTS INTERNATIONAUX.\nLe projet est une application microservices et sert à :\n- Demander un virement international\n- Déclaration des bénéficiaires internationaux\n- La signature d'une demande de virement international\n- Consulter l'historique et suivre le statut d'un transfert international et d'une demande de déclaration de bénéficiaire déclaration de bénéficiaire.\n▪ CONCEPTION ET DÉVELOPPEMENT D'UN MODULE DE CRYPTAGE ET DE SCELLEMENT.\n- Le module consiste à décrypter et desceller les fichiers téléchargés afin d'effectuer un réordonnancement avant de vérifier la validité du fichier. Pour vérifier la validité du fichier, pour cela chaque client dispose d'une clé publique pour effectuer le scellement et pour le cryptage tous les clients utilisent la même clé pour décrypter les fichiers téléchargés. ",
    "description2": "▪ Développé par une équipe de 2 personnes en utilisant la méthode AGILE.\n▪ Le front-end de l'application est développé par IONIC 4 et le framework Angular, le back-end est développé par Spring boot.\n▪ Utilisation de Spring Security et JWT pour la sécurité de l'application.",
    "description3": "▪ L'application est développée en PHP (Framework Laravel) Création d'une commande à l'aide d'un job Laravel qui s'exécute quotidiennement pour lire des fichiers csv depuis un serveur FTP et les traiter dans le but d'afficher des statistiques.",
    "description4": "▪ Le projet est une application monolithique conçue sur la base du design pattern MVC côté serveur, la partie présentation est développée par le moteur de template Thymeleaf.",
    "description5": "▪ Mise à niveau du réseau LAN de l'agence provinciale de services de Beni Mellal et installation de routeurs d'accès sécurisé via un réseau mobile 4G/3G.",
    "years": "Années d'expérience",
    "describeMe": "Développeur web et mobile, spécialisé dans les microservices avec java et le front-end avec Angular/react."
  },

  "info": {
    "title": "Ingénieur logiciel (JavaEE, react/Angular), freelance basé en France",
    "contactMe": "Contactez-moi"
  },
  "skills": {
    "title1": "SGBD",
    "title2": "Analyse et Conception",
    "title3": "Langages de programmation",
    "title4": "Développement Web",
    "title5": "Développement Mobile",
    "title6": "Intégration de données",
    "title7": "DevOps",
    "title8": "Logiciels/IDE"
  }
}
